#include <iostream>
#include <bits/stdc++.h>
using namespace std;

// Скорее всего похожая задача есть на Kattis, UVa, LeetCode или CF, но я не нашёл. Я натолкнулся на неё в процессе
// изучения Recursive Backtracking, но там тоже не было точного описания или ссылки на оригинал задачи. Вот суть:
// * Для данной доски NxN нужно посчитать, сколько способов есть пройтись конём по всей доске,
// наступая на каждое поле 1 раз. При n = 5, существует 1728 таких способов, при n = 6 уже 6637920
int main()
{
  int n;
  scanf("%d", &n);

  // ... Чуть позже реализую

  return 0;
}