#include <iostream>
#include <bits/stdc++.h>
using namespace std;

// Codeforces 1351B (900) - Квадрат?, O(n) для ввода
int main()
{
  int t, a1, b1, a2, b2; // 1 ≤ t ≤ 10^4, 1 ≤ a1, b1, a2, b2 ≤ 100
  scanf("%d", &t);
  while (t--)
  {
    scanf("%d %d", &a1, &b1);
    scanf("%d %d", &a2, &b2);
    cout << ((
                 (a1 + a2 == b1 && b1 == b2) || // Первый случай: всё на своих местах
                 (b1 == a2 && a1 + b2 == b1) || // Второй случай: вторая фигура повёрнута на 90°
                 (a1 == b2 && b1 + a2 == a1) || // Третий случай: первая фигура повёрнута на 90°
                 (b1 + b2 == a1 && a1 == a2)    // Четвёртый случай: обе фигуры повёрнуты на 90°
                 )
                 ? "YES\n"
                 : "NO\n");
  }

  return 0;
}